validation/pitzDaily/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
12225
(
(-0.01980858153881727 0.0001594203008596372 2.56820698888819e-21)
(-0.01825736440606035 0.0001594203008596372 1.068551355890912e-22)
(-0.01676812353716467 0.0001594203008596372 3.566399472419947e-22)
(-0.01533838277505262 0.0001594203008596372 -4.56096175805657e-21)
(-0.0139657648933257 0.0001594203008596372 1.739031360478916e-21)
(-0.01264798764365612 0.0001594203008596372 -1.263986503627726e-20)
(-0.01138285996109823 0.0001594203008596372 -6.600331124518132e-20)
(-0.01016827832101024 0.0001594203008596372 1.861027784683912e-22)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(-0.0206 0.0001594203008596372 2.15678504627215e-21)
(-0.0206 0.0004897030495701851 -2.339874448994295e-21)
(-0.0206 0.0008436913347716934 -2.290546154810306e-22)
(-0.0206 0.001223086584899399 -6.810944350976668e-22)
(-0.0206 0.001629712345798594 -9.627238267426728e-23)
(-0.0206 0.002065523045513977 -1.27610479845556e-21)
(-0.0206 0.002532613388158299 -4.730067972612925e-21)
(-0.0206 0.003033228422011468 -1.867807058661555e-21)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
57
(
(0.29 -0.01629259259259259 5.322494807532129e-21)
(0.29 -0.01567777777777778 4.537669828754363e-21)
(0.2899999999999998 -0.01506296296296296 4.537669828754362e-21)
(0.2899999999999999 -0.01444814814814814 -3.955157521341716e-22)
(0.2899999999999999 -0.01383333333333334 -3.955157521341716e-22)
(0.29 -0.01321851851851852 -3.759051375467187e-21)
(0.2899999999999999 -0.0126037037037037 -2.654270278145645e-21)
(0.29 -0.01198888888888889 2.278915302742889e-21)
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<vector> 
223
(
(-0.01980858153881727 0.0254 4.100906236087823e-21)
(-0.01825736440606034 0.02539999999999999 2.892183275606093e-21)
(-0.01676812353716467 0.0254 5.069220268356429e-21)
(-0.01533838277505262 0.0254 -6.519725851949083e-22)
(-0.0139657648933257 0.0254 3.904329840946263e-21)
(-0.01264798764365612 0.0254 -4.404599939531037e-21)
(-0.01138285996109822 0.0254 2.492375351787018e-21)
(-0.01016827832101024 0.0254 -2.314067399345377e-21)
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
250
(
(-0.01980858153881727 0 -4.100906236087823e-21)
(-0.01825736440606035 0 -2.892183275606093e-21)
(-0.01676812353716467 0 -5.069220268356429e-21)
(-0.01533838277505262 0 6.519725851949083e-22)
(-0.0139657648933257 0 -3.904329840946263e-21)
(-0.01264798764365612 0 4.404599939531036e-21)
(-0.01138285996109822 0 -2.492375351787018e-21)
(-0.01016827832101024 0 2.314067399345377e-21)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
