validation/pitzDaily/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
12225
(
-0.01980858153881727
-0.01825736440606035
-0.01676812353716467
-0.01533838277505262
-0.0139657648933257
-0.01264798764365612
-0.01138285996109823
-0.01016827832101024
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
-0.0206
-0.0206
-0.0206
-0.0206
-0.0206
-0.0206
-0.0206
-0.0206
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
57
(
0.29
0.29
0.2899999999999998
0.2899999999999999
0.2899999999999999
0.29
0.2899999999999999
0.29
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
223
(
-0.01980858153881727
-0.01825736440606034
-0.01676812353716467
-0.01533838277505262
-0.0139657648933257
-0.01264798764365612
-0.01138285996109822
-0.01016827832101024
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
250
(
-0.01980858153881727
-0.01825736440606035
-0.01676812353716467
-0.01533838277505262
-0.0139657648933257
-0.01264798764365612
-0.01138285996109822
-0.01016827832101024
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
