validation/pitzDaily/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
12225
(
0.0001594203008596372
0.0001594203008596372
0.0001594203008596372
0.0001594203008596372
0.0001594203008596372
0.0001594203008596372
0.0001594203008596372
0.0001594203008596372
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.0001594203008596372
0.0004897030495701851
0.0008436913347716934
0.001223086584899399
0.001629712345798594
0.002065523045513977
0.002532613388158299
0.003033228422011468
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
57
(
-0.01629259259259259
-0.01567777777777778
-0.01506296296296296
-0.01444814814814814
-0.01383333333333334
-0.01321851851851852
-0.0126037037037037
-0.01198888888888889
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
223
(
0.0254
0.02539999999999999
0.0254
0.0254
0.0254
0.0254
0.0254
0.0254
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
250
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
