validation/pitzDaily/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
12225
(
2.56820698888819e-21
1.068551355890912e-22
3.566399472419947e-22
-4.56096175805657e-21
1.739031360478916e-21
-1.263986503627726e-20
-6.600331124518132e-20
1.861027784683912e-22
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
2.15678504627215e-21
-2.339874448994295e-21
-2.290546154810306e-22
-6.810944350976668e-22
-9.627238267426728e-23
-1.27610479845556e-21
-4.730067972612925e-21
-1.867807058661555e-21
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
57
(
5.322494807532129e-21
4.537669828754363e-21
4.537669828754362e-21
-3.955157521341716e-22
-3.955157521341716e-22
-3.759051375467187e-21
-2.654270278145645e-21
2.278915302742889e-21
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
223
(
4.100906236087823e-21
2.892183275606093e-21
5.069220268356429e-21
-6.519725851949083e-22
3.904329840946263e-21
-4.404599939531037e-21
2.492375351787018e-21
-2.314067399345377e-21
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
250
(
-4.100906236087823e-21
-2.892183275606093e-21
-5.069220268356429e-21
6.519725851949083e-22
-3.904329840946263e-21
4.404599939531036e-21
-2.492375351787018e-21
2.314067399345377e-21
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
